Autodesk.Revit.DB.Structure.ReinforcementUtils.GetBarBendingPlaneNormalAtIndex(Autodesk.Revit.DB.Element,System.Int32,Autodesk.Revit.DB.XYZ@)
Gets the normal of the plane in which the reinforcement element is bent.
Remarks:
Only the bar segments are used to compute the bar bending plane. Hooks are ignored.
reinforcementElement:
The reinforcement element from which the normal data is provided. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1), representing the bar in set from which we're using the hook data.
normal:
the normal of the plane in which the reinforcement element is bent. In case of a Free Form bar that is not planar, it will return XYZ(0,0,0)
Returns:
Returns true if it was able to calculate the normal for the input reinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].